
/*-----------------------------------------------------------------------------
 *  2012 年 4 月 67 日的腾讯暑期实习生招聘笔试中,出了一道与上述 21 题类似的题, 原题大致如下:
 *  两个数组 a[N],b[N],其中 A[N]的各个元素值已知,现给 b[i]赋值,b[i] = a[0]*a[1]*a[2]...*a[N-1]/a[i];
 *  要求:
 *  1. 不准用除法运算
 *  2. 除了循环计数值,a[N],b[N]外,不准再用其他任何变量(包括局部变量,全局变量
 *  等)
 *  188
 *  3. 满足时间复杂度O(n),空间复杂度O(1)。
 *-----------------------------------------------------------------------------*/

void ArrayExclusiveMulti(int a[], int b[])
{
    b[0] = 1;
    for (int i = 1; i < N; i++)
    {
	b[0] *= a[i-1];
	b[i] = b[0];
    }
    b[0] = 1;
    for (i = N-2; i > 0; i--)
    {
	b[0] *= a[i+1];
	b[i] *= b[0];
    }
    b[0] *= a[1];
}
